#  2-2. 다음 10*10 2차원 배열 matrix 안에 가로로 1이 연속으로 있는 부분중 가장 길이가 긴 부분은 얼마인지 구해보세요.
N = 10
matrix = [
    [0, 1, 1, 1, 1, 1, 0, 0, 1, 0],
    [1, 0, 0, 1, 0, 0, 1, 1, 0, 1],
    [1, 1, 1, 0, 0, 1, 1, 0, 1, 0],
    [1, 0, 1, 1, 1, 1, 0, 1, 1, 0],
    [0, 0, 1, 1, 0, 1, 0, 1, 0, 0],
    [0, 1, 1, 0, 1, 0, 0, 1, 0, 1],
    [1, 1, 1, 1, 1, 1, 1, 1, 0, 0],
    [0, 0, 1, 0, 1, 0, 1, 1, 0, 1],
    [0, 0, 0, 0, 1, 1, 1, 1, 0, 1],
    [1, 0, 0, 1, 1, 1, 0, 0, 1, 0],
]

max_len = 0

for row in matrix:
    cur = 0
    for i in row:
        if i == 1:
            cur += 1
            if cur > max_len:
                max_len = cur
        
        else:
            cur = 0

print(max_len)